



expenses = [1500, 3000, 500, 12000, 800]
print("Все траты:", expenses)
print("Общая сумма:", sum(expenses))
print("Самая крупная трата:", max(expenses))

# это дает возможность сложить весь список(list) "sum(expenses)"
# это показывает самое большое число в переменной "max(expenses)"
# это показывает количество чисел в переменной "len(expenses)"

# каждое число внутри переменной имеет свой индекс от 0
print(expenses[0])   # 1500 — первый элемент
print(expenses[1])   # 3000 — второй элемент
print(expenses[-1])  # 800 — последний элемент (удобно для "последняя трата")


